In [14]:
from sqlalchemy import create_engine
import pandas as pd

In [15]:
db_host = '127.0.0.1'
username = 'testuser'
user_pass = 'Karan@123'
db_name = 'testor'

In [16]:
conn = create_engine('mysql+pymysql://'+username+':'+user_pass+'@'+db_host+'/'+db_name)
conn.table_names()

['attendees', 'avgsalary', 'avgsalary2']

In [18]:
query = 'select * from avgsalary'
avgsalary = pd.read_sql(query,conn)
print(avgsalary.shape)
avgsalary

(4, 2)

  city2  avgsalary
0     M      12000
1     B      11000
2     Q       9000
3    LI       8500

In [9]:
attendees.isnull().sum()

personid            0
heroname            0
age                 0
assets              0
sector              0
city                0
salary              0
distancetraveled    0
rating              1
dtype: int64

In [10]:
attendees.shape

(5, 9)

In [12]:
attendees.max()

personid                 5
heroname            X Man
age                    200
assets              900000
sector                Tech
city                     Q
salary               12500
distancetraveled        13
rating                   9
dtype: object